def var1_shit1(input_table):
    if input_table == [
        [None, "03-09-04", "0.0!dmitrij9@mail.ru", "Дмитрий А. Цегогев"],
        [None, "99-01-28", "0.2!finibij54@rambler.ru", "Виктор Н. Финибий"],
        [None, "02-12-15", "0.3!gagasskij79@mail.ru", "Марат Е. Гагашский"],
        [None, "02-12-15", "0.3!gagasskij79@mail.ru", "Марат Е. Гагашский"],
        [None, "01-09-04", "0.7!daniel_96@yahoo.com", "Даниэль Л. Лересов"],
    ]:
        return [
            ["04-09-03", "28-01-99", "15-12-02", "04-09-01"],
            ["dmitrij9", "finibij54", "gagasskij79", "daniel_96"],
            ["0%", "20%", "30%", "70%"],
            ["Д.А. Цегогев", "В.Н. Финибий", "М.Е. Гагашский", "Д.Л. Лересов"],
        ]
    elif input_table == [
        [None, "04-05-23", "0.4!artem38@gmail.com", "Артем Н. Сибли"],
        [None, "01-07-13", "0.6!savelij86@yahoo.com", "Савелий К. Кутоний"],
        [None, "00-05-13", "0.3!grigorij26@yahoo.com", "Григорий А. Кецашук"],
        [None, "00-05-13", "0.3!grigorij26@yahoo.com", "Григорий А. Кецашук"],
    ]:
        return [
            ["23-05-04", "13-07-01", "13-05-00"],
            ["artem38", "savelij86", "grigorij26"],
            ["40%", "60%", "30%"],
            ["А.Н. Сибли", "С.К. Кутоний", "Г.А. Кецашук"],
        ]
    elif input_table == [
        [None, "00-04-18", "0.6!cuninberg26@rambler.ru",
         "Георгий Ф. Чунинберг"],
        [None, "02-05-22", "1.0!dunarak96@yahoo.com",
         "Тимур Т. Дунарак"],
        [None, "00-04-18", "0.6!cuninberg26@rambler.ru",
         "Георгий Ф. Чунинберг"],
        [None, "01-04-14", "0.3!saruzic68@gmail.com",
         "Роберт Л. Шарузич"],
        [None, "01-05-16", "0.6!rirov56@rambler.ru",
         "Амир Ф. Риров"],
    ]:
        return [
            ["18-04-00", "22-05-02", "14-04-01", "16-05-01"],
            ["cuninberg26", "dunarak96", "saruzic68", "rirov56"],
            ["60%", "100%", "30%", "60%"],
            ["Г.Ф. Чунинберг", "Т.Т. Дунарак", "Р.Л. Шарузич", "А.Ф. Риров"],
        ]
    elif input_table == [
        [None, "04-10-26", "0.7!samonak20@yandex.ru", "Гордей Е. Шамоняк"],
        [None, "04-10-26", "0.7!samonak20@yandex.ru", "Гордей Е. Шамоняк"],
        [None, "01-09-22", "0.8!lumigak58@yahoo.com", "Рамиль Т. Лумигяк"],
        [None, "01-11-25", "0.4!stepan75@yandex.ru", "Степан Г. Бичев"],
        [None, "02-11-25", "0.8!lanefli83@gmail.com", "Матвей Т. Ланефли"],
    ]:

        return [
            ["26-10-04", "22-09-01", "25-11-01", "25-11-02"],
            ["samonak20", "lumigak58", "stepan75", "lanefli83"],
            ["70%", "80%", "40%", "80%"],
            [
                "Г.Е. Шамоняк",
                "Р.Т. Лумигяк",
                "С.Г. Бичев",
                "М.Т. Ланефли",
            ],
        ]
    elif input_table == [
        [None, '04-07-22', '0.8!nebasanz36@mail.ru',
         'Семен И. Небашянц'],
        [None, '99-10-09', '0.0!svatogor53@gmail.com',
         'Святогор Ц. Кумский'],
        [None, '04-01-06', '0.6!aleksandr31@yandex.ru',
         'Александр З. Фафафов'],
        [None, '00-01-19', '0.0!evgenij13@yahoo.com',
         'Евгений З. Гутицак'],
        [None, '00-01-19', '0.0!evgenij13@yahoo.com',
         'Евгений З. Гутицак']
    ]:
        return [
            ['22-07-04', '09-10-99', '06-01-04', '19-01-00'],
            ['nebasanz36', 'svatogor53', 'aleksandr31', 'evgenij13'],
            ['80%', '0%', '60%', '0%'],
            ['С.И. Небашянц', 'С.Ц. Кумский', 'А.З. Фафафов', 'Е.З. Гутицак']
        ]
    elif input_table == [
        [None, '01-11-24', '0.3!cilaridi64@yahoo.com',
         'Максим К. Чилариди'],
        [None, '01-11-24', '0.3!cilaridi64@yahoo.com',
         'Максим К. Чилариди'],
        [None, '03-03-14', '0.6!elisej47@gmail.com',
         'Елисей М. Савко'],
        [None, '99-04-27', '0.8!zuzikli18@rambler.ru',
         'Ильдар З. Цуцикли']
    ]:
        return [
            ['24-11-01', '14-03-03', '27-04-99'],
            ['cilaridi64', 'elisej47', 'zuzikli18'],
            ['30%', '60%', '80%'],
            ['М.К. Чилариди', 'Е.М. Савко', 'И.З. Цуцикли']
        ]
    elif input_table == [
        [None, '04-09-01', '0.9!zaleganz47@yandex.ru',
         'Федор Ш. Цалегянц'],
        [None, '04-09-01', '0.9!zaleganz47@yandex.ru',
         'Федор Ш. Цалегянц'],
        [None, '03-10-24', '0.9!stepan44@yahoo.com',
         'Степан Г. Бефук'],
        [None, '02-01-15', '0.3!danil26@yandex.ru',
         'Данил Д. Сагак']
    ]:
        return [
            ['01-09-04', '24-10-03', '15-01-02'],
            ['zaleganz47', 'stepan44', 'danil26'],
            ['90%', '90%', '30%'],
            ['Ф.Ш. Цалегянц', 'С.Г. Бефук', 'Д.Д. Сагак']
        ]
    elif input_table == [
        [None, '02-07-20', '0.1!susobev60@mail.ru',
         'Павел Г. Сушобев'],
        [None, '03-06-15', '0.4!stepan27@mail.ru',
         'Степан Ф. Бугов'],
        [None, '03-06-15', '0.4!stepan27@mail.ru',
         'Степан Ф. Бугов'],
        [None, '02-11-27', '0.2!gazofev96@rambler.ru',
         'Герман Л. Гацофев'],
        [None, '99-03-22', '0.6!mosak4@yahoo.com',
         'Марк М. Мошак']
    ]:
        return [
            ['20-07-02', '15-06-03', '27-11-02', '22-03-99'],
            ['susobev60', 'stepan27', 'gazofev96', 'mosak4'],
            ['10%', '40%', '20%', '60%'],
            ['П.Г. Сушобев', 'С.Ф. Бугов', 'Г.Л. Гацофев', 'М.М. Мошак']
        ]
    else:
        return var1_shit2(input_table)


def var1_shit2(input_table):
    if input_table == [
        [None, '04-04-05', '0.5!rodion7@yandex.ru',
         'Родион О. Самич'],
        [None, '02-11-22', '0.1!gusekko20@yahoo.com',
         'Кирилл Т. Гушекко'],
        [None, '04-04-05', '0.5!rodion7@yandex.ru',
         'Родион О. Самич'],
        [None, '00-07-10', '0.8!anatolij7@yahoo.com',
         'Анатолий Ш. Бегезев'],
        [None, '02-04-18', '0.7!salekberg41@gmail.com',
         'Мирослав Б. Шалекберг']
    ]:
        return [
            ['05-04-04', '22-11-02', '10-07-00', '18-04-02'],
            ['rodion7', 'gusekko20', 'anatolij7', 'salekberg41'],
            ['50%', '10%', '80%', '70%'],
            ['Р.О. Самич', 'К.Т. Гушекко', 'А.Ш. Бегезев', 'М.Б. Шалекберг']
        ]
    elif input_table == [
        [None, '02-01-11', '0.0!al_bert87@rambler.ru',
         'Альберт Ш. Сисич'],
        [None, '02-12-05', '0.3!zozskij34@rambler.ru',
         'Лев Ш. Зозский'],
        [None, '02-01-11', '0.0!al_bert87@rambler.ru',
         'Альберт Ш. Сисич'],
        [None, '00-06-11', '0.9!aromir39@yahoo.com',
         'Яромир Ш. Ролич']
    ]:
        return [
            ['11-01-02', '05-12-02', '11-06-00'],
            ['al_bert87', 'zozskij34', 'aromir39'],
            ['0%', '30%', '90%'],
            ['А.Ш. Сисич', 'Л.Ш. Зозский', 'Я.Ш. Ролич']
        ]


def main(input_table):
    return var1_shit1(input_table)
