X = 5 >= 2
A = {1, 3, 7, 8}
B = {2, 4, 5, 10, 'apple'}
C = A & B
df = 'Антоновна Антонина', 34, 'ж'
Z = 'type'
D = [1, 'title', 2, 'content']


print('\n',
      f'Переменная X= {X}                             ||    Тип переменной{type(X)}', '\n',
      f'Переменная A= {A}                     ||    Тип переменной{type(A)}', '\n',
      f'Переменная B= {B}           ||    Тип переменной{type(B)}', '\n',
      f'Переменная C= {C}                            ||    Тип переменной{type(C)}', '\n',
      f'Переменная df= {df} ||    Тип переменной{type(df)}', '\n',
      f'Переменная Z= {Z}                             ||    Тип переменной{type(Z)}', '\n',
      f'Переменная D= {D}       ||    Тип переменной{type(D)}', '\n')
#%%
